'''
문제 설명

당신은 n개의 스테이지(1번 → n번)를 순서대로 모두 해결해야 합니다.
각 스테이지를 클리어 하기 위해서는 해결 비용이 들며, 힌트권을 많이 사용할수록 비용이 줄어듭니다.
    힌트권에는 1~n번까지의 번호가 붙어 있습니다.
    i번 힌트권은 오직 i번 스테이지에서만 사용 가능합니다.
    하나의 스테이지에서 사용할 수 있는 힌트권의 최대 개수는 n-1개입니다.
    초기에는 힌트권을 가지고 있지 않습니다.
마지막 스테이지를 제외한 각 스테이지에서는 해당 스테이지에서 판매하는 힌트 번들을 최대 1개 구매할 수 있습니다.
힌트 번들은 이후 스테이지의 힌트권을 제공하며 비용을 주고 사야합니다.
    스테이지마다 구매 가능한 힌트 번들의 종류와 판매 가격이 다를 수 있습니다.
    힌트 번들에는 힌트권이 총 k장 들어 있으며, 같은 번호의 힌트권이 여러 장 포함될 수도 있습니다.
    i번 스테이지에서 판매하는 힌트 번들에는 항상 i+1번 이상의 번호를 가진 힌트권만 들어 있습니다.
당신은 모든 스테이지를 해결하는데 필요한 최소 비용을 구해야 합니다.


당신은 모든 스테이지를 해결하는데 필요한 최소 비용을 구해야 합니다.
예를 들어 각 스테이지의 해결 비용과 힌트 번들 정보가 아래 표와 같다고 가정해 보겠습니다.
스테이지 해결 비용(힌트권 사용 수에 따른 해결 비용)
힌트권 사용 수	0	1	2	3	4
스테이지 #1	160	140	120	110	60
스테이지 #2	290	270	260	120	10
스테이지 #3	160	130	120	60	20
스테이지 #4	160	120	80	70	20
스테이지 #5	110	70	60	30	20

힌트 번들
스테이지	판매 가격	힌트권 번호
스테이지 #1	40	#2, #3
스테이지 #2	40	#5, #3
스테이지 #3	20	#5, #4
스테이지 #4	50	#5, #5

다음과 같이 총 810(= 160+40+270+130+20+120+70)만큼의 비용으로 모든 스테이지를 해결 가능하며, 이보다 적은 비용은 불가능합니다.

    스테이지 #1을 힌트권을 사용하지 않고 160만큼의 비용으로 해결합니다. 비용을 40만큼 지불하고 #2, #3 힌트권을 얻습니다.
    스테이지 #2을 힌트권 1장을 사용하고 270만큼의 비용으로 해결합니다.
    스테이지 #3을 힌트권 1장을 사용하고 130만큼의 비용으로 해결합니다. 비용을 20만큼 지불하고 #5, #4 힌트권을 얻습니다.
    스테이지 #4를 힌트권 1장을 사용하고 120만큼의 비용으로 해결합니다.
    스테이지 #5를 힌트권 1장을 사용하고 70만큼의 비용으로 해결합니다.

각 스테이지의 힌트권 사용 수에 따른 해결 비용을 담은 2차원 정수 배열 cost와
각 스테이지에서 구매 가능한 힌트 번들의 비용과 포함된 힌트권 번호를 담은 2차원 정수 배열 hint가 매개변수로 주어집니다.

모든 스테이지를 해결하는데 필요한 최소 비용을 return 하도록 solution 함수를 완성해 주세요.


제한사항

2 ≤ cost의 길이 = n ≤ 16
cost[i]의 길이 = n
cost[i][j]는 i+1번 스테이지에서 힌트권을 j개 사용했을 때의 해결 비용입니다.
1 ≤ cost[i][j] ≤ 100,000
cost[i][j] > cost[i][j+1]
hint의 길이 = n-1
2 ≤ hint[i]의 길이 = k+1 ≤ 20
hint[i][0]은 i+1번 스테이지에서 판매하는 힌트 번들의 판매 가격입니다.
0 ≤ hint[i][0] ≤ 1,000,000
hint[i][j](j>0)는 i+1번 스테이지에서 판매하는 힌트 번들에 j번째로 들어있는 힌트권 번호입니다.
i+1 < hint[i][j] ≤ n (j>0)

'''

'''
문제분해

- 잘 모르겠다. 이럴 땐 그냥 브루트 포스로 어택해버리자.
- 각 스테이지에서 구매를 했을 때, 안했을 때로 경우의 수는 2의 n-1승. (마지막 스테이지에선 힌트 구매 못 함.)
- 각 경우의 수의 cost를 기록하는 배열 sum_list 만들어서 기록
- 각 경우의 수 구하는 법:
    - 
- sum_list의 최소값이 answer!

'''

# solution1, brute force attack!
def solution1(cost, hint):
    sum_list = []
    
    is_hint_bought = [0] * len(cost) # is_hint_bought[i], 스테이지 i+1 에서 힌트 번들 구매 여부. (i=0 부터)
    hint_counter = [0] * len(cost) # hint_counter[i], 스테이지 i+1 에서 사용 가능한 힌트 개수. (i=0 부터)
    sum_hint_cost = 0 #지불한 힌트 번들 금액
    
    
    for i in range(len(hint[0])):
        sum_hint_cost = sum_hint_cost + hint[i+1]
        hint_counter[[hint[i+1]]] = hint_counter[[hint[i+1]]] + 1
    
    sum = 0
    for i in range(len(cost)):
        sum = sum + cost[i][hint_counter[i]]
    
    answer = 0
    return answer
'''
what do I need now?
- 각 스테이지 에서의 hint 번들 구매 여부
- 각 경우의 수 별 사용가능한 hint 개수
- 모든 경우의 수를 0과 1로 표현한 리스트
'''
'''

cost = [[160, 140, 120, 110, 60],
        [290, 270, 260, 120, 10], 
        [160, 130, 120, 60, 20], 
        [160, 120, 80, 70, 20], 
        [110, 70, 60, 30, 20]]
    
hint = [[40, 2, 3], 
        [40, 5, 3], 
        [20, 5, 4], 
        [50, 5, 5]]
        

    
'''